## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`


**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 5 to change, 5 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.server_metrics_container_execution_role will be created
  + resource "aws_iam_role" "server_metrics_container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "server_metrics_container_execution_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.server_metrics_task_execution_role will be destroyed
  - resource "aws_iam_role" "server_metrics_task_execution_role" {
      - arn                   = "arn:aws:iam::005133826942:role/server_metrics_task_execution_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-07-05T18:48:52Z" -> null
      - force_detach_policies = false -> null
      - id                    = "server_metrics_task_execution_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::005133826942:policy/ETLTaskExecutionPolicies",
          - "arn:aws:iam::005133826942:policy/GetMetricstokenSecretValuePolicies",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "server_metrics_task_execution_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQCMP77N7PN3TQOY47" -> null

      - inline_policy {}
    }

  # aws_iam_role_policy.scheduled_task_cw_event_role_cloudwatch_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "scheduled_task_cw_event_role_cloudwatch_policy" {
        id     = "etl-st-cw-role:etl-st-cw-policy"
        name   = "etl-st-cw-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = "ecs:RunTask"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  ~ {
                      ~ Resource = [
                          - "arn:aws:iam::005133826942:role/server_metrics_task_execution_role",
                            "arn:aws:iam::005133826942:role/server_appstore_metrics_task_execution_role",
                            # (2 unchanged elements hidden)
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.secretsmanager_etl_policies must be replaced
-/+ resource "aws_iam_role_policy_attachment" "secretsmanager_etl_policies" {
      ~ id         = "server_metrics_task_execution_role-20210705184853773700000001" -> (known after apply)
      ~ role       = "server_metrics_task_execution_role" -> "server_metrics_container_execution_role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.server_metrics_te_etl_policies will be destroyed
  - resource "aws_iam_role_policy_attachment" "server_metrics_te_etl_policies" {
      - id         = "server_metrics_task_execution_role-20210706165905405600000001" -> null
      - policy_arn = "arn:aws:iam::005133826942:policy/ETLTaskExecutionPolicies" -> null
      - role       = "server_metrics_task_execution_role" -> null
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_rule.event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "event_rule" {
        id                  = "masked_server_metrics_event_rule"
        name                = "masked_server_metrics_event_rule"
      ~ schedule_expression = "rate(1 minute)" -> "rate(24 hours)"
        tags                = {
            "Name" = "masked_server_metrics-cw-event-rule"
        }
        # (4 unchanged attributes hidden)
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_server_metrics_event_rule-terraform-20210702182404782300000005"
      - input          = jsonencode({}) -> null
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:4" -> (known after apply)
      ~ id                       = "masked_server_metrics" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
      ~ task_role_arn            = "arn:aws:iam::005133826942:role/server_metrics_task_execution_role" -> "arn:aws:iam::005133826942:role/server_appstore_metrics_task_execution_role" # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_rule.event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "event_rule" {
        id                  = "unmasked_server_metrics_event_rule"
        name                = "unmasked_server_metrics_event_rule"
      ~ schedule_expression = "rate(1 minute)" -> "rate(24 hours)"
        tags                = {
            "Name" = "unmasked_server_metrics-cw-event-rule"
        }
        # (4 unchanged attributes hidden)
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_server_metrics_event_rule-terraform-20210702182404726800000003"
      - input          = jsonencode({}) -> null
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_server_metrics:5" -> (known after apply)
      ~ id                       = "unmasked_server_metrics" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
      ~ task_role_arn            = "arn:aws:iam::005133826942:role/server_metrics_task_execution_role" -> "arn:aws:iam::005133826942:role/server_appstore_metrics_task_execution_role" # forces replacement
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 5 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>